import "./App.css";
import Table from "./components/Table";

const DATA = [
  {
    id: 1,
    name: "выручка, руб",
    datasale: [
      "890 110",
      "256 005",
      "205 010",
      "560 320",
      "600 720",
      "480 521",
      "500 521",
    ],
    week: "4 805 121",
  },
  {
    id: 2,
    name: "наличные",
    datasale: [
      "400 000",
      "300 000",
      "200 000",
      "100 000",
      "300 000",
      "300 000",
      "300 000",
    ],
    week: "300 000",
  },
  {
    id: 3,
    name: "безналичный расчёт",
    datasale: [
      "100 000",
      "0",
      "300 000",
      "50 000",
      "150 000",
      "100 000",
      "100 000",
    ],
    week: "100 000",
  },
  {
    id: 4,
    name: "Кредитные карты",
    datasale: [
      "90 110",
      "256 005",
      "100 521",
      "150 521",
      "100 521",
      "100 521",
      "100 521",
    ],

    week: "100 521",
  },
  {
    id: 5,
    name: "средний чек, руб",
    datasale: ["110", "1 300", "5 010", "2 320", "720", "900", "1 300"],
    week: "900",
  },
  {
    id: 6,
    name: "средний гость, руб",
    datasale: ["110", "3 005", "1 010", "2 320", "1 200", "800", "1 200"],
    week: "800",
  },
  {
    id: 7,
    name: "удвление из чека (после оплаты), руб",
    datasale: ["1 000", "1 000", "5 010", "1 000", "2 720", "1 000", "1 000"],
    week: "900",
  },
  {
    id: 8,
    name: "удаление из чека (до оплаты), руб",
    datasale: ["1 300", "1 005", "1 300", "3 320", "2 720", "1 300", "1 300"],
    week: "900",
  },
  {
    id: 9,
    name: "количестов чеков",
    datasale: ["34", "36", " 20", "40", "36", "36", "34"],
    week: "34",
  },
  {
    id: 10,
    name: "количество гостей",
    datasale: ["34", "36", " 20", "40", "36", "34", "36"],
    week: "32",
  },
];

function App() {
  return (
    <>
      <Table data={DATA} />
    </>
  );
}

export default App;
